Revit 2027 API
MEPHiddenLineSettings.OutsideGap Property
 The gap for the lines that appear external to the crossing segments.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double OutsideGap { get; set; }
Public Property OutsideGap As Double
	Get
	Set
public:
property double OutsideGap {
	double get ();
	void set (double value);
}
member OutsideGap : float with get, set
Property Value
Double
Exceptions
Exception | Condition
ArgumentException |  When setting this property: The gap size must be between 0" and 3/4".
See Also
Reference
MEPHiddenLineSettings Class
Autodesk.Revit.DB.Mechanical Namespace